linux_FAQ/archlinux_FAQ.org
#+title:archlinux使用FAQ
#+email:goodaniu@163.com
#+options: \n:t num:t toc:t f:nil
#+startup:indent
* archlinux
** archlinux备份配置文件

1.新增配置文件备份
#+BEGIN_SRC bash
sudo tar -cjvpP -T /home/spark/document/arch-backlist -f /home/data/backup/arch-backup.tar.bz2
sudo tar -cjvpP -T filelist -f backup.tar.bz2
tar cvpzf backup.tgz –exclude=/proc –exclude=/lost+found –exclude=/backup.tgz –exclude=/mnt –exclude=/sys /
#+END_SRC

** awmtt-test-awesome

使用 awmtt调试awesome 
awmttAUR (Awesome WM Testing Tool) 是一个基于 Xephyr 的易于使用的脚本。默认情况下，它会测试~/.config/awesome/rc.lua.test 。如果该文件不存在，它会测试当前使用的 rc.lua 。也可以指定要测试的配置文件所在路径：

#+BEGIN_SRC bash
$ awmtt start -C ~/.config/awesome/rc.lua.new
$ awmtt stop
$ awmtt restart
#+END_SRC

** chattr
#+BEGIN_QUOTE
chattr命令文件权限属性设置

lsattr命令可以查看文件的第二扩展文件系统属性
chattr命令用来改变文件属性。这项指令可改变存放在ext2文件系统上的文件或目录属性，这些属性共有以下8种模式：

a：让文件或目录仅供附加用途；
b：不更新文件或目录的最后存取时间；
c：将文件或目录压缩后存放；
d：将文件或目录排除在倾倒操作之外；
i：不得任意更动文件或目录；
s：保密性删除文件或目录；
S：即时更新文件或目录；
u：预防意外删除。
语法
chattr(选项)
选项
-R：递归处理，将指令目录下的所有文件及子目录一并处理；
-v<版本编号>：设置文件或目录版本；
-V：显示指令执行过程；
+<属性>：开启文件或目录的该项属性；
-<属性>：关闭文件或目录的该项属性；
=<属性>：指定文件或目录的该项属性。
实例
用chattr命令防止系统中某个关键文件被修改：

chattr +i /etc/fstab
然后试一下rm、mv、rename等命令操作于该文件，都是得到Operation not permitted的结果。

让某个文件只能往里面追加内容，不能删除，一些日志文件适用于这种操作：

chattr +a /data1/user_act.log
#+END_QUOTE

** chroot

#+BEGIN_SRC bash

 mount /dev/sdxY /mnt         
 mount /dev/sdxZ /mnt/boot   
 cd /mnt
 sudo mount -t proc proc proc/
 sudo mount --rbind /sys sys/
 sudo mount --rbind /dev dev/
 sudo mount --rbind /run run/
 sudo cp /etc/resolv.conf etc/resolv.conf 
 sudo chroot /mnt /bin/bash
 source /etc/profile
 source ~/.bashrc
 export PS1="(chroot) $PS1"

 exit
 cd /
 sudo umount -R /mnt  # umount --recursive /location/of/new/root

#+END_SRC
** comm

#+BEGIN_QUOTE
原始文件如下：
a.txt
d
c
b
a

b.txt
g
f
b
a
排序处理 
sort a.txt > a1.txt
sort b.txt > b1.txt
处理结果文件如下： 
a1.txt
a
b
c
d

b1.txt
a
b
f
g
比较处理 

| comm | a1.txt | b1.txt |
| 1    | 2      | 3      |
|------+--------+--------|
|      |        | a      |
|      |        | b      |
|      | f      |        |
|      | g      |        |
| c    |        |        |
| d    |        |        |
输出结果包括3列 其中第3列显示的是2个文件中都包含的内容。
第1列显示只包含在第一个文件a.txt中的
第2列显示只包含在第二个文件b.txt中的

可以通过参数指定要显示的列 如：
comm a1.txt b1.txt -12
a
b

-3 显示两个文件特有的行
-1 显示第2个文件所有行
-2 显示第1个文件所有的行
-12 不显示第1列和第2列，只显示第3列，即两个文件共有的行
-13 不显示第1，3列，显示第2列，即第2个文件特有的行
-23 不显示第2，3列，显示第1列，即第1个文件特有的行
#+END_QUOTE

** cp完全复制迁移系统

#+BEGIN_SRC bash
#!/bin/bash
mkdir /mnt/old
mkdir /mnt/new
mount /dev/sda5 /mnt/old
mount /dev/sda1 /mnt/new
cp -aP /mnt/old /mnt/new
nano /etc/fstab
sudo update-grub
#+END_SRC

** kill_tty

1. 用tty命令可以得到终端名，如：

   #+BEGIN_SRC bash
   tty
   /dev/tty1
   #+END_SRC
2. 用ps -t 命令可以得到终端的进程号，如：
   $ ps -t tty1       或 ps -t /dev/tty1

   PID TTY          TIME CMD
   
   31419 tty1    00:00:00 bash

3. 用kill -9命令可以将进程杀掉，以关闭终端。前提：kill命令的执行者必须是超级用户或对tty1的进程有操作权限，否则，命令会报错：Operation not permitted，如：
   $ kill -9 31419

** ln

ln -s /home/spark/.cache/kuwo/song ~/music/

ln -s 源目录  新链接

** mp3乱码

mid3iconv -e gbk *.mp3

