linux_FAQ/archlinux_FAQ.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-18 Sun 17:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>archlinux使用FAQ</title>
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">archlinux使用FAQ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline32">1. archlinux</a>
<ul>
<li><a href="#orgheadline1">1.1. archlinux备份配置文件</a></li>
<li><a href="#orgheadline2">1.2. awmtt-test-awesome</a></li>
<li><a href="#orgheadline3">1.3. chattr</a></li>
<li><a href="#orgheadline4">1.4. chroot</a></li>
<li><a href="#orgheadline5">1.5. comm</a></li>
<li><a href="#orgheadline6">1.6. cp完全复制迁移系统</a></li>
<li><a href="#orgheadline7">1.7. kill<sub>tty</sub></a></li>
<li><a href="#orgheadline8">1.8. ln</a></li>
<li><a href="#orgheadline9">1.9. mp3乱码</a></li>
<li><a href="#orgheadline10">1.10. org-mode的一些技巧</a></li>
<li><a href="#orgheadline11">1.11. send-mail</a></li>
<li><a href="#orgheadline12">1.12. swapfile</a></li>
<li><a href="#orgheadline13">1.13. tar</a></li>
<li><a href="#orgheadline14">1.14. tar.txt</a></li>
<li><a href="#orgheadline15">1.15. txt转码</a></li>
<li><a href="#orgheadline16">1.16. vim去除所有中文字符</a></li>
<li><a href="#orgheadline17">1.17. xinit</a></li>
<li><a href="#orgheadline18">1.18. xinitrc</a></li>
<li><a href="#orgheadline19">1.19. xrandr</a></li>
<li><a href="#orgheadline20">1.20. 备份和恢复已安装软件包</a></li>
<li><a href="#orgheadline21">1.21. 查看文件夹大小</a></li>
<li><a href="#orgheadline22">1.22. 常用正则表达式</a></li>
<li><a href="#orgheadline23">1.23. 挂载非系统分区</a></li>
<li><a href="#orgheadline24">1.24. 镜像排速</a></li>
<li><a href="#orgheadline25">1.25. 清理日志</a></li>
<li><a href="#orgheadline26">1.26. 清理无用包</a></li>
<li><a href="#orgheadline27">1.27. 删除文本的行</a></li>
<li><a href="#orgheadline28">1.28. 修复引导.txt</a></li>
<li><a href="#orgheadline29">1.29. 修改屏幕亮度</a></li>
<li><a href="#orgheadline30">1.30. 用户</a></li>
<li><a href="#orgheadline31">1.31. 重装所有软件</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">1</span> archlinux</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> archlinux备份配置文件</h3>
<div class="outline-text-3" id="text-1-1">
<p>
1.新增配置文件备份<br  />
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo tar -cjvpP -T /home/spark/document/arch-backlist -f /home/data/backup/arch-backup.tar.bz2
sudo tar -cjvpP -T filelist -f backup.tar.bz2
tar cvpzf backup.tgz &#8211;<span style="color: #F92672;">exclude</span>=/proc &#8211;<span style="color: #F92672;">exclude</span>=/lost+found &#8211;<span style="color: #F92672;">exclude</span>=/backup.tgz &#8211;<span style="color: #F92672;">exclude</span>=/mnt &#8211;<span style="color: #F92672;">exclude</span>=/sys /
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> awmtt-test-awesome</h3>
<div class="outline-text-3" id="text-1-2">
<p>
使用 awmtt调试awesome<br  />
awmttAUR (Awesome WM Testing Tool) 是一个基于 Xephyr 的易于使用的脚本。默认情况下，它会测试~/.config/awesome/rc.lua.test 。如果该文件不存在，它会测试当前使用的 rc.lua 。也可以指定要测试的配置文件所在路径：<br  />
</p>

<div class="org-src-container">

<pre class="src src-bash">$ awmtt start -C ~/.config/awesome/rc.lua.new
$ awmtt stop
$ awmtt restart
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> chattr</h3>
<div class="outline-text-3" id="text-1-3">
<blockquote>
<p>
chattr命令文件权限属性设置<br  />
</p>

<p>
lsattr命令可以查看文件的第二扩展文件系统属性<br  />
chattr命令用来改变文件属性。这项指令可改变存放在ext2文件系统上的文件或目录属性，这些属性共有以下8种模式：<br  />
</p>

<p>
a：让文件或目录仅供附加用途；<br  />
b：不更新文件或目录的最后存取时间；<br  />
c：将文件或目录压缩后存放；<br  />
d：将文件或目录排除在倾倒操作之外；<br  />
i：不得任意更动文件或目录；<br  />
s：保密性删除文件或目录；<br  />
S：即时更新文件或目录；<br  />
u：预防意外删除。<br  />
语法<br  />
chattr(选项)<br  />
选项<br  />
-R：递归处理，将指令目录下的所有文件及子目录一并处理；<br  />
-v&lt;版本编号&gt;：设置文件或目录版本；<br  />
-V：显示指令执行过程；<br  />
+&lt;属性&gt;：开启文件或目录的该项属性；<br  />
-&lt;属性&gt;：关闭文件或目录的该项属性；<br  />
=&lt;属性&gt;：指定文件或目录的该项属性。<br  />
实例<br  />
用chattr命令防止系统中某个关键文件被修改：<br  />
</p>

<p>
chattr +i /etc/fstab<br  />
然后试一下rm、mv、rename等命令操作于该文件，都是得到Operation not permitted的结果。<br  />
</p>

<p>
让某个文件只能往里面追加内容，不能删除，一些日志文件适用于这种操作：<br  />
</p>

<p>
chattr +a /data1/user<sub>act.log</sub><br  />
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> chroot</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-bash">mount /dev/sdxY /mnt         
mount /dev/sdxZ /mnt/boot   
<span style="color: #A6E22E;">cd</span> /mnt
sudo mount -t proc proc proc/
sudo mount --rbind /sys sys/
sudo mount --rbind /dev dev/
sudo mount --rbind /run run/
sudo cp /etc/resolv.conf etc/resolv.conf 
sudo chroot /mnt /bin/bash
<span style="color: #A6E22E;">source</span> /etc/profile
<span style="color: #A6E22E;">source</span> ~/.bashrc
<span style="color: #A6E22E;">export</span> <span style="color: #F92672;">PS1</span>=<span style="color: #E6DB74;">"(chroot) $PS1"</span>

<span style="color: #66D9EF;">exit</span>
<span style="color: #A6E22E;">cd</span> /
sudo umount -R /mnt  <span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">umount --recursive /location/of/new/root</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> comm</h3>
<div class="outline-text-3" id="text-1-5">
<blockquote>
<p>
原始文件如下：<br  />
a.txt<br  />
d<br  />
c<br  />
b<br  />
a<br  />
</p>

<p>
b.txt<br  />
g<br  />
f<br  />
b<br  />
a<br  />
排序处理<br  />
sort a.txt &gt; a1.txt<br  />
sort b.txt &gt; b1.txt<br  />
处理结果文件如下：<br  />
a1.txt<br  />
a<br  />
b<br  />
c<br  />
d<br  />
</p>

<p>
b1.txt<br  />
a<br  />
b<br  />
f<br  />
g<br  />
比较处理<br  />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">comm</th>
<th scope="col" class="org-left">a1.txt</th>
<th scope="col" class="org-left">b1.txt</th>
</tr>

<tr>
<th scope="col" class="org-right">1</th>
<th scope="col" class="org-left">2</th>
<th scope="col" class="org-left">3</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">f</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">g</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">d</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
输出结果包括3列 其中第3列显示的是2个文件中都包含的内容。<br  />
第1列显示只包含在第一个文件a.txt中的<br  />
第2列显示只包含在第二个文件b.txt中的<br  />
</p>

<p>
可以通过参数指定要显示的列 如：<br  />
comm a1.txt b1.txt -12<br  />
a<br  />
b<br  />
</p>

<p>
-3 显示两个文件特有的行<br  />
-1 显示第2个文件所有行<br  />
-2 显示第1个文件所有的行<br  />
-12 不显示第1列和第2列，只显示第3列，即两个文件共有的行<br  />
-13 不显示第1，3列，显示第2列，即第2个文件特有的行<br  />
-23 不显示第2，3列，显示第1列，即第1个文件特有的行<br  />
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> cp完全复制迁移系统</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">!/bin/</span><span style="color: #66D9EF;">bash</span>
mkdir /mnt/old
mkdir /mnt/new
mount /dev/sda5 /mnt/old
mount /dev/sda1 /mnt/new
cp -aP /mnt/old /mnt/new
nano /etc/fstab
sudo update-grub
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> kill<sub>tty</sub></h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li><p>
用tty命令可以得到终端名，如：<br  />
</p>

<div class="org-src-container">

<pre class="src src-bash">tty
/dev/tty1
</pre>
</div></li>
<li><p>
用ps -t 命令可以得到终端的进程号，如：<br  />
$ ps -t tty1       或 ps -t /dev/tty1<br  />
</p>

<p>
PID TTY          TIME CMD<br  />
</p>

<p>
31419 tty1    00:00:00 bash<br  />
</p></li>

<li>用kill -9命令可以将进程杀掉，以关闭终端。前提：kill命令的执行者必须是超级用户或对tty1的进程有操作权限，否则，命令会报错：Operation not permitted，如：<br  />
$ kill -9 31419<br  /></li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> ln</h3>
<div class="outline-text-3" id="text-1-8">
<p>
ln -s <i>home/spark</i>.cache/kuwo/song ~/music/<br  />
</p>

<p>
ln -s 源目录  新链接<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.9</span> mp3乱码</h3>
<div class="outline-text-3" id="text-1-9">
<p>
mid3iconv -e gbk *.mp3<br  />
</p>
</div>
</div>
