linux_FAQ/archlinux_FAQ.org
** org-mode的一些技巧

#+BEGIN_QUOTE
用org-mode写博客

1 配置GNU Emacs 的编码

在配置文件里写入以下内容

(setq current-language-environment "UTF-8")
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
2 修改GNU Emacs 的lisp包

去掉与HOME相连的UP

2.1 linux

我的系统是slackware 14.1，源码编译安装最新的emacs24.5前，修改lisp/org/ox-html.el，找到‘，删删除’UP‘，用M-x byte-compile-file编译成elc文件。

2.2 Windows

打开 lisp/org/org-html.el lisp/org/ox-html.el 修改org-export-html-home/up-format

(defcustom org-export-html-home/up-format
  "<div id=\"org-div-home-and-up\" style=\"text-align:right;font-size:100%%;white-space:nowrap;\">
<a accesskey=\"H\" href=\"%s\"> HOME </a>
</div>"
  "Snippet used to insert the HOME and UP links.
This is a format string, the first %s will receive the UP link,
the second the HOME link.  If both `org-export-html-link-up' and
`org-export-html-link-home' are empty, the entire snippet will be
ignored."
  :group 'org-export-html
  :type 'string)
因为GNU Emacs 默认会读elc文件，所以修改好后，用M-x byte-compile-file 编译一下。

3 去掉Validate XHTML 1.0

在配置文件里写入

(setq org-export-html-validation-link nil)
在org-mode 8 中更改为org-html-validation-link

4 介绍模板文件

4.1 Google Analytisc

Google Analytisc 代码用#+HTML_HEAD逐行写在内容前面。

4.2 Disqus

Disqus 代码用#+BEGIN_HTML #+END_HTML 写在内容后面。

4.3 网页

4.3.1 CSS 文件

CSS 代码参考这个

<link rel="stylesheet" type="text/css" href="/css/worg.css" />
前面加#+HTML_HEAD 加在内容前面。

4.3.2 favicon

参考

<LINK REL="SHORTCUT ICON" HREF="/IMAGES/FAVICON.ICO"/>
4.3.3 DESCRIPTION

用#+DESCRIPTION: 添加

4.3.4 网页标题

用#+TITLE: 添加

4.3.5 主页

用#+LINK_HOME: 添加

4.4 文档元数据

下面的内容都是ORG-MODE 默认开启，而我要关闭它们。这节的配置都写在#+OPTIONS: 后面

4.4.1 取消目录里各级标题前的数字

NUM:NIL

4.4.2 取消生成工具

CREATOR:NIL

4.4.3 取消作者

AUTHOR:NIL

4.4.4 取消时间

TIMESTAMP:NIL

4.4.5 取消目录

TOC:NIL

4.4.6 取消TEX的转义

_ 会使得后面的内容变成下标，加上下面的选项可以避免。 ^:NIL

4.5 内容元数据

4.5.1 加源代码

用#+BEGIN_SRC C -N … #+END_SRC，C可以换成别的语言，-N显示行号。

4.5.2 内容居中

用#+BEGIN_CENTER … #+END_CENTER

4.5.3 插入HTML

用#+BEGIN_HTML … #+END_HTML

#+END_QUOTE

** send-mail

发送邮件

echo "测试test" | mutt -s "test" goodaniu@163.com

直接发送，不会打开vim和邮件发送客户端

mutt goodaniu@163.com -s 'test send mail'

会打开vim编辑器和邮件客户端，需要手工输入一些控制命令

** swapfile

#+BEGIN_SRC bash
fallocate -l 1G /swapfile
chmod 600 /swapfile
mkswap /swapfile
swapon /swapfile
echo  "/swapfile					none 		swap 		defaults 	0 0" >>/etc/fstab
#+END_SRC

** tar

#+BEGIN_QUOTE
tar命令文件压缩与解压

其实最简单的使用 tar 就只要记忆底下的方式即可：

压　缩：tar -jcv -f filename.tar.bz2 要被压缩的文件或目录名称
查　询：tar -jtv -f filename.tar.bz2
解压缩：tar -jxv -f filename.tar.bz2 -C 欲解压缩的目录


tar命令可以为linux的文件和目录创建档案。利用tar，可以为某一特定文件创建档案（备份文件），也可以在档案中改变文件，或者向档案中加入新的文件。tar最初被用来在磁带上创建档案，现在，用户可以在任何设备上创建档案。利用tar命令，可以把一大堆的文件和目录全部打包成一个文件，这对于备份文件或将几个文件组合成为一个文件以便于网络传输是非常有用的。

首先要弄清两个概念：打包和压缩。打包是指将一大堆文件或目录变成一个总的文件；压缩则是将一个大的文件通过一些压缩算法变成一个小文件。

为什么要区分这两个概念呢？这源于Linux中很多压缩程序只能针对一个文件进行压缩，这样当你想要压缩一大堆文件时，你得先将这一大堆文件先打成一个包（tar命令），然后再用压缩程序进行压缩（gzip bzip2命令）。

语法
tar(选项)(参数)
选项
-A或--catenate：新增文件到以存在的备份文件；
-B：设置区块大小；
-c或--create：建立新的备份文件；
-C <目录>：这个选项用在解压缩，若要在特定目录解压缩，可以使用这个选项。
-d：记录文件的差别；
-x或--extract或--get：从备份文件中还原文件；
-t或--list：列出备份文件的内容；
-z或--gzip或--ungzip：通过gzip指令处理备份文件；
-Z或--compress或--uncompress：通过compress指令处理备份文件；
-f<备份文件>或--file=<备份文件>：指定备份文件；
-v或--verbose：显示指令执行过程；
-r：添加文件到已经压缩的文件；
-u：添加改变了和现有的文件到已经存在的压缩文件；
-j：支持bzip2解压文件；
-v：显示操作过程；
-l：文件系统边界设置；
-k：保留原有文件不覆盖；
-m：保留文件不被覆盖；
-w：确认压缩文件的正确性；
-p或--same-permissions：用原来的文件权限还原文件；
-P或--absolute-names：文件名使用绝对名称，不移除文件名称前的“/”号；
-N <日期格式> 或 --newer=<日期时间>：只将较指定日期更新的文件保存到备份文件里；
--exclude=<范本样式>：排除符合范本样式的文件。
参数
文件或目录：指定要打包的文件或目录列表。

实例
将文件全部打包成tar包：

tar -cvf log.tar log2012.log    仅打包，不压缩！ 
tar -zcvf log.tar.gz log2012.log   打包后，以 gzip 压缩 
tar -jcvf log.tar.bz2 log2012.log  打包后，以 bzip2 压缩 
在选项f之后的文件档名是自己取的，我们习惯上都用 .tar 来作为辨识。 如果加z选项，则以.tar.gz或.tgz来代表gzip压缩过的tar包；如果加j选项，则以.tar.bz2来作为tar包名。

查阅上述tar包内有哪些文件：

tar -ztvf log.tar.gz
由于我们使用 gzip 压缩的log.tar.gz，所以要查阅log.tar.gz包内的文件时，就得要加上z这个选项了。

将tar包解压缩：

tar -zxvf /opt/soft/test/log.tar.gz
在预设的情况下，我们可以将压缩档在任何地方解开的

只将tar内的部分文件解压出来：

tar -zxvf /opt/soft/test/log30.tar.gz log2013.log
我可以透过tar -ztvf来查阅 tar 包内的文件名称，如果单只要一个文件，就可以透过这个方式来解压部分文件！

文件备份下来，并且保存其权限：

tar -zcvpf log31.tar.gz log2014.log log2015.log log2016.log
这个-p的属性是很重要的，尤其是当您要保留原本文件的属性时。

在文件夹当中，比某个日期新的文件才备份：

tar -N "2012/11/13" -zcvf log17.tar.gz test
备份文件夹内容是排除部分文件：

tar --exclude scf/service -zcvf scf.tar.gz scf/*

#+END_QUOTE

** tar.txt

#+BEGIN_QUOTE
﻿tar命令文件压缩与解压

其实最简单的使用 tar 就只要记忆底下的方式即可： 
压　缩：tar -jcv -f filename.tar.bz2 要被压缩的文件或目录名称 
查　询：tar -jtv -f filename.tar.bz2 
解压缩：tar -jxv -f filename.tar.bz2 -C 欲解压缩的目录

-c: 建立压缩档案
-x：解压
-t：查看内容
-r：向压缩归档文件末尾追加文件
-u：更新原压缩包中的文件
这五个是独立的命令，压缩解压都要用到其中一个，可以和别的命令连用但只能用其中一个。下面的参数是根据需要在压缩或解压档案时可选的。

-z：有gzip属性的
-j：有bz2属性的
-Z：有compress属性的
-v：显示所有过程
-O：将文件解开到标准输出
-p或--same-permissions：用原来的文件权限还原文件；

下面的参数-f是必须的
-f: 使用档案名字，切记，这个参数是最后一个参数，后面只能接档案名。
 tar -cf all.tar *.jpg
这条命令是将所有.jpg的文件打成一个名为all.tar的包。-c是表示产生新的包，-f指定包的文件名。
 tar -rf all.tar *.gif
这条命令是将所有.gif的文件增加到all.tar的包里面去。-r是表示增加文件的意思。

 tar -uf all.tar logo.gif
这条命令是更新原来tar包all.tar中logo.gif文件，-u是表示更新文件的意思。

 tar -tf all.tar
这条命令是列出all.tar包中所有文件，-t是列出文件的意思

 tar -xf all.tar
这条命令是解出all.tar包中所有文件，-t是解开的意思
压缩
tar -cvf jpg.tar *.jpg //将目录里所有jpg文件打包成tar.jpg 
tar -czf jpg.tar.gz *.jpg   //将目录里所有jpg文件打包成jpg.tar后，并且将其用gzip压缩，生成一个gzip压缩过的包，命名为jpg.tar.gz
 tar -cjf jpg.tar.bz2 *.jpg //将目录里所有jpg文件打包成jpg.tar后，并且将其用bzip2压缩，生成一个bzip2压缩过的包，命名为jpg.tar.bz2
tar -cZf jpg.tar.Z *.jpg   //将目录里所有jpg文件打包成jpg.tar后，并且将其用compress压缩，生成一个umcompress压缩过的包，命名为jpg.tar.Z
rar a jpg.rar *.jpg //rar格式的压缩，需要先下载rar for linux
zip jpg.zip *.jpg //zip格式的压缩，需要先下载zip for linux
解压
tar -xvf file.tar //解压 tar包
tar -xzvf file.tar.gz //解压tar.gz
tar -xjvf file.tar.bz2   //解压 tar.bz2
tar -xZvf file.tar.Z   //解压tar.Z
unrar e file.rar //解压rar
unzip file.zip //解压zip
总结
1、*.tar 用 tar -xvf 解压
2、*.gz 用 gzip -d或者gunzip 解压
3、*.tar.gz和*.tgz 用 tar -xzf 解压
4、*.bz2 用 bzip2 -d或者用bunzip2 解压
5、*.tar.bz2用tar -xjf 解压
6、*.Z 用 uncompress 解压
7、*.tar.Z 用tar -xZf 解压
8、*.rar 用 unrar e解压
9、*.zip 用 unzip 解压

#+END_QUOTE
** txt转码

iconv -f gb18030 -t utf-8 sanguozhi.txt >sgz.txt

iconv -f CP850 -t UTF-8 sanguozhi.txt >sgz.txt

** vim去除所有中文字符

:%s/\v[^\x00-\xff]+//g 

