linux_FAQ/archlinux_FAQ.html

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.10</span> org-mode的一些技巧</h3>
<div class="outline-text-3" id="text-1-10">
<blockquote>
<p>
用org-mode写博客<br  />
</p>

<p>
1 配置GNU Emacs 的编码<br  />
</p>

<p>
在配置文件里写入以下内容<br  />
</p>

<p>
(setq current-language-environment "UTF-8")<br  />
(setq locale-coding-system 'utf-8)<br  />
(set-terminal-coding-system 'utf-8)<br  />
(set-keyboard-coding-system 'utf-8)<br  />
(set-selection-coding-system 'utf-8)<br  />
(prefer-coding-system 'utf-8)<br  />
2 修改GNU Emacs 的lisp包<br  />
</p>

<p>
去掉与HOME相连的UP<br  />
</p>

<p>
2.1 linux<br  />
</p>

<p>
我的系统是slackware 14.1，源码编译安装最新的emacs24.5前，修改lisp/org/ox-html.el，找到‘，删删除’UP‘，用M-x byte-compile-file编译成elc文件。<br  />
</p>

<p>
2.2 Windows<br  />
</p>

<p>
打开 lisp/org/org-html.el lisp/org/ox-html.el 修改org-export-html-home/up-format<br  />
</p>

<p>
(defcustom org-export-html-home/up-format<br  />
  "&lt;div id=\"org-div-home-and-up\" style=\"text-align:right;font-size:100%%;white-space:nowrap;\"&gt;<br  />
&lt;a accesskey=\"H\" href=\"%s\"&gt; HOME &lt;/a&gt;<br  />
&lt;/div&gt;"<br  />
  "Snippet used to insert the HOME and UP links.<br  />
This is a format string, the first %s will receive the UP link,<br  />
the second the HOME link.  If both `org-export-html-link-up' and<br  />
`org-export-html-link-home' are empty, the entire snippet will be<br  />
ignored."<br  />
  :group 'org-export-html<br  />
  :type 'string)<br  />
因为GNU Emacs 默认会读elc文件，所以修改好后，用M-x byte-compile-file 编译一下。<br  />
</p>

<p>
3 去掉Validate XHTML 1.0<br  />
</p>

<p>
在配置文件里写入<br  />
</p>

<p>
(setq org-export-html-validation-link nil)<br  />
在org-mode 8 中更改为org-html-validation-link<br  />
</p>

<p>
4 介绍模板文件<br  />
</p>

<p>
4.1 Google Analytisc<br  />
</p>

<p>
Google Analytisc 代码用#+HTML<sub>HEAD逐行写在内容前面</sub>。<br  />
</p>

<p>
4.2 Disqus<br  />
</p>

<p>
Disqus 代码用#+BEGIN<sub>HTML</sub> #+END<sub>HTML</sub> 写在内容后面。<br  />
</p>

<p>
4.3 网页<br  />
</p>

<p>
4.3.1 CSS 文件<br  />
</p>

<p>
CSS 代码参考这个<br  />
</p>

<p>
&lt;link rel="stylesheet" type="text/css" href="/css/worg.css" /&gt;<br  />
前面加#+HTML<sub>HEAD</sub> 加在内容前面。<br  />
</p>

<p>
4.3.2 favicon<br  />
</p>

<p>
参考<br  />
</p>

<p>
&lt;LINK REL="SHORTCUT ICON" HREF="/IMAGES/FAVICON.ICO"/&gt;<br  />
4.3.3 DESCRIPTION<br  />
</p>

<p>
用#+DESCRIPTION: 添加<br  />
</p>

<p>
4.3.4 网页标题<br  />
</p>

<p>
用#+TITLE: 添加<br  />
</p>

<p>
4.3.5 主页<br  />
</p>

<p>
用#+LINK<sub>HOME</sub>: 添加<br  />
</p>

<p>
4.4 文档元数据<br  />
</p>

<p>
下面的内容都是ORG-MODE 默认开启，而我要关闭它们。这节的配置都写在#+OPTIONS: 后面<br  />
</p>

<p>
4.4.1 取消目录里各级标题前的数字<br  />
</p>

<p>
NUM:NIL<br  />
</p>

<p>
4.4.2 取消生成工具<br  />
</p>

<p>
CREATOR:NIL<br  />
</p>

<p>
4.4.3 取消作者<br  />
</p>

<p>
AUTHOR:NIL<br  />
</p>

<p>
4.4.4 取消时间<br  />
</p>

<p>
TIMESTAMP:NIL<br  />
</p>

<p>
4.4.5 取消目录<br  />
</p>

<p>
TOC:NIL<br  />
</p>

<p>
4.4.6 取消TEX的转义<br  />
</p>

<p>
_ 会使得后面的内容变成下标，加上下面的选项可以避免。 ^:NIL<br  />
</p>

<p>
4.5 内容元数据<br  />
</p>

<p>
4.5.1 加源代码<br  />
</p>

<p>
用#+BEGIN<sub>SRC</sub> C -N … #+END<sub>SRC</sub>，C可以换成别的语言，-N显示行号。<br  />
</p>

<p>
4.5.2 内容居中<br  />
</p>

<p>
用#+BEGIN<sub>CENTER</sub> … #+END<sub>CENTER</sub><br  />
</p>

<p>
4.5.3 插入HTML<br  />
</p>

<p>
用#+BEGIN<sub>HTML</sub> … #+END<sub>HTML</sub><br  />
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.11</span> send-mail</h3>
<div class="outline-text-3" id="text-1-11">
<p>
发送邮件<br  />
</p>

<p>
echo "测试test" | mutt -s "test" goodaniu@163.com<br  />
</p>

<p>
直接发送，不会打开vim和邮件发送客户端<br  />
</p>

<p>
mutt goodaniu@163.com -s 'test send mail'<br  />
</p>

<p>
会打开vim编辑器和邮件客户端，需要手工输入一些控制命令<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.12</span> swapfile</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">

<pre class="src src-bash">fallocate -l 1G /swapfile
chmod 600 /swapfile
mkswap /swapfile
swapon /swapfile
<span style="color: #A6E22E;">echo</span>  <span style="color: #E6DB74;">"/swapfile                    none        swap        defaults    0 0"</span> &gt;&gt;/etc/fstab
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">1.13</span> tar</h3>
<div class="outline-text-3" id="text-1-13">
<blockquote>
<p>
tar命令文件压缩与解压<br  />
</p>

<p>
其实最简单的使用 tar 就只要记忆底下的方式即可：<br  />
</p>

<p>
压　缩：tar -jcv -f filename.tar.bz2 要被压缩的文件或目录名称<br  />
查　询：tar -jtv -f filename.tar.bz2<br  />
解压缩：tar -jxv -f filename.tar.bz2 -C 欲解压缩的目录<br  />
</p>


<p>
tar命令可以为linux的文件和目录创建档案。利用tar，可以为某一特定文件创建档案（备份文件），也可以在档案中改变文件，或者向档案中加入新的文件。tar最初被用来在磁带上创建档案，现在，用户可以在任何设备上创建档案。利用tar命令，可以把一大堆的文件和目录全部打包成一个文件，这对于备份文件或将几个文件组合成为一个文件以便于网络传输是非常有用的。<br  />
</p>

<p>
首先要弄清两个概念：打包和压缩。打包是指将一大堆文件或目录变成一个总的文件；压缩则是将一个大的文件通过一些压缩算法变成一个小文件。<br  />
</p>

<p>
为什么要区分这两个概念呢？这源于Linux中很多压缩程序只能针对一个文件进行压缩，这样当你想要压缩一大堆文件时，你得先将这一大堆文件先打成一个包（tar命令），然后再用压缩程序进行压缩（gzip bzip2命令）。<br  />
</p>

<p>
语法<br  />
tar(选项)(参数)<br  />
选项<br  />
-A或&#x2013;catenate：新增文件到以存在的备份文件；<br  />
-B：设置区块大小；<br  />
-c或&#x2013;create：建立新的备份文件；<br  />
-C &lt;目录&gt;：这个选项用在解压缩，若要在特定目录解压缩，可以使用这个选项。<br  />
-d：记录文件的差别；<br  />
-x或&#x2013;extract或&#x2013;get：从备份文件中还原文件；<br  />
-t或&#x2013;list：列出备份文件的内容；<br  />
-z或&#x2013;gzip或&#x2013;ungzip：通过gzip指令处理备份文件；<br  />
-Z或&#x2013;compress或&#x2013;uncompress：通过compress指令处理备份文件；<br  />
-f&lt;备份文件&gt;或&#x2013;file=&lt;备份文件&gt;：指定备份文件；<br  />
-v或&#x2013;verbose：显示指令执行过程；<br  />
-r：添加文件到已经压缩的文件；<br  />
-u：添加改变了和现有的文件到已经存在的压缩文件；<br  />
-j：支持bzip2解压文件；<br  />
-v：显示操作过程；<br  />
-l：文件系统边界设置；<br  />
-k：保留原有文件不覆盖；<br  />
-m：保留文件不被覆盖；<br  />
-w：确认压缩文件的正确性；<br  />
-p或&#x2013;same-permissions：用原来的文件权限还原文件；<br  />
-P或&#x2013;absolute-names：文件名使用绝对名称，不移除文件名称前的“/”号；<br  />
-N &lt;日期格式&gt; 或 &#x2013;newer=&lt;日期时间&gt;：只将较指定日期更新的文件保存到备份文件里；<br  />
&#x2013;exclude=&lt;范本样式&gt;：排除符合范本样式的文件。<br  />
参数<br  />
文件或目录：指定要打包的文件或目录列表。<br  />
</p>

<p>
实例<br  />
将文件全部打包成tar包：<br  />
</p>

<p>
tar -cvf log.tar log2012.log    仅打包，不压缩！<br  />
tar -zcvf log.tar.gz log2012.log   打包后，以 gzip 压缩<br  />
tar -jcvf log.tar.bz2 log2012.log  打包后，以 bzip2 压缩<br  />
在选项f之后的文件档名是自己取的，我们习惯上都用 .tar 来作为辨识。 如果加z选项，则以.tar.gz或.tgz来代表gzip压缩过的tar包；如果加j选项，则以.tar.bz2来作为tar包名。<br  />
</p>

<p>
查阅上述tar包内有哪些文件：<br  />
</p>

<p>
tar -ztvf log.tar.gz<br  />
由于我们使用 gzip 压缩的log.tar.gz，所以要查阅log.tar.gz包内的文件时，就得要加上z这个选项了。<br  />
</p>

<p>
将tar包解压缩：<br  />
</p>

<p>
tar -zxvf /opt/soft/test/log.tar.gz<br  />
在预设的情况下，我们可以将压缩档在任何地方解开的<br  />
</p>

<p>
只将tar内的部分文件解压出来：<br  />
</p>

<p>
tar -zxvf /opt/soft/test/log30.tar.gz log2013.log<br  />
我可以透过tar -ztvf来查阅 tar 包内的文件名称，如果单只要一个文件，就可以透过这个方式来解压部分文件！<br  />
</p>

<p>
文件备份下来，并且保存其权限：<br  />
</p>

<p>
tar -zcvpf log31.tar.gz log2014.log log2015.log log2016.log<br  />
这个-p的属性是很重要的，尤其是当您要保留原本文件的属性时。<br  />
</p>

<p>
在文件夹当中，比某个日期新的文件才备份：<br  />
</p>

<p>
tar -N "2012/11/13" -zcvf log17.tar.gz test<br  />
备份文件夹内容是排除部分文件：<br  />
</p>

<p>
tar &#x2013;exclude scf/service -zcvf scf.tar.gz scf/*<br  />
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">1.14</span> tar.txt</h3>
<div class="outline-text-3" id="text-1-14">
<blockquote>
<p>
﻿tar命令文件压缩与解压<br  />
</p>

<p>
其实最简单的使用 tar 就只要记忆底下的方式即可：<br  />
压　缩：tar -jcv -f filename.tar.bz2 要被压缩的文件或目录名称<br  />
查　询：tar -jtv -f filename.tar.bz2<br  />
解压缩：tar -jxv -f filename.tar.bz2 -C 欲解压缩的目录<br  />
</p>

<p>
-c: 建立压缩档案<br  />
-x：解压<br  />
-t：查看内容<br  />
-r：向压缩归档文件末尾追加文件<br  />
-u：更新原压缩包中的文件<br  />
这五个是独立的命令，压缩解压都要用到其中一个，可以和别的命令连用但只能用其中一个。下面的参数是根据需要在压缩或解压档案时可选的。<br  />
</p>

<p>
-z：有gzip属性的<br  />
-j：有bz2属性的<br  />
-Z：有compress属性的<br  />
-v：显示所有过程<br  />
-O：将文件解开到标准输出<br  />
-p或&#x2013;same-permissions：用原来的文件权限还原文件；<br  />
</p>

<p>
下面的参数-f是必须的<br  />
-f: 使用档案名字，切记，这个参数是最后一个参数，后面只能接档案名。<br  />
 tar -cf all.tar *.jpg<br  />
这条命令是将所有.jpg的文件打成一个名为all.tar的包。-c是表示产生新的包，-f指定包的文件名。<br  />
 tar -rf all.tar *.gif<br  />
这条命令是将所有.gif的文件增加到all.tar的包里面去。-r是表示增加文件的意思。<br  />
</p>

<p>
 tar -uf all.tar logo.gif<br  />
这条命令是更新原来tar包all.tar中logo.gif文件，-u是表示更新文件的意思。<br  />
</p>

<p>
 tar -tf all.tar<br  />
这条命令是列出all.tar包中所有文件，-t是列出文件的意思<br  />
</p>

<p>
 tar -xf all.tar<br  />
这条命令是解出all.tar包中所有文件，-t是解开的意思<br  />
压缩<br  />
tar -cvf jpg.tar *.jpg //将目录里所有jpg文件打包成tar.jpg <br  />
tar -czf jpg.tar.gz *.jpg   //将目录里所有jpg文件打包成jpg.tar后，并且将其用gzip压缩，生成一个gzip压缩过的包，命名为jpg.tar.gz<br  />
 tar -cjf jpg.tar.bz2 *.jpg //将目录里所有jpg文件打包成jpg.tar后，并且将其用bzip2压缩，生成一个bzip2压缩过的包，命名为jpg.tar.bz2<br  />
tar -cZf jpg.tar.Z *.jpg   //将目录里所有jpg文件打包成jpg.tar后，并且将其用compress压缩，生成一个umcompress压缩过的包，命名为jpg.tar.Z<br  />
rar a jpg.rar *.jpg //rar格式的压缩，需要先下载rar for linux<br  />
zip jpg.zip *.jpg //zip格式的压缩，需要先下载zip for linux<br  />
解压<br  />
tar -xvf file.tar //解压 tar包<br  />
tar -xzvf file.tar.gz //解压tar.gz<br  />
tar -xjvf file.tar.bz2   //解压 tar.bz2<br  />
tar -xZvf file.tar.Z   //解压tar.Z<br  />
unrar e file.rar //解压rar<br  />
unzip file.zip //解压zip<br  />
总结<br  />
1、*.tar 用 tar -xvf 解压<br  />
2、*.gz 用 gzip -d或者gunzip 解压<br  />
3、*.tar.gz和*.tgz 用 tar -xzf 解压<br  />
4、*.bz2 用 bzip2 -d或者用bunzip2 解压<br  />
5、*.tar.bz2用tar -xjf 解压<br  />
6、*.Z 用 uncompress 解压<br  />
7、*.tar.Z 用tar -xZf 解压<br  />
8、*.rar 用 unrar e解压<br  />
9、*.zip 用 unzip 解压<br  />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">1.15</span> txt转码</h3>
<div class="outline-text-3" id="text-1-15">
<p>
iconv -f gb18030 -t utf-8 sanguozhi.txt &gt;sgz.txt<br  />
</p>

<p>
iconv -f CP850 -t UTF-8 sanguozhi.txt &gt;sgz.txt<br  />
</p>
</div>
</div>
