linux_FAQ/archlinux_FAQ.html

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">1.16</span> vim去除所有中文字符</h3>
<div class="outline-text-3" id="text-1-16">
<p>
:%s/\v[^\x00-\xff]+//g<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">1.17</span> xinit</h3>
<div class="outline-text-3" id="text-1-17">
<blockquote>
<p>
~/.xinitrc<br  />
&#x2026;<br  />
</p>

<p>
 Here Xfce is kept as default<br  />
session=${1:-xfce}<br  />
</p>

<p>
case $session in<br  />
    awesome           ) exec awesome;;<br  />
    bspwm             ) exec bspwm;;<br  />
    catwm             ) exec catwm;;<br  />
    cinnamon          ) exec cinnamon-session;;<br  />
    dwm               ) exec dwm;;<br  />
    enlightenment     ) exec enlightenment<sub>start</sub>;;<br  />
    ede               ) exec startede;;<br  />
    fluxbox           ) exec startfluxbox;;<br  />
    gnome             ) exec gnome-session;;<br  />
    gnome-classic     ) exec gnome-session &#x2013;session=gnome-classic;;<br  />
    i3|i3wm           ) exec i3;;<br  />
    icewm             ) exec icewm-session;;<br  />
    jwm               ) exec jwm;;<br  />
    kde               ) exec startkde;;<br  />
    mate              ) exec mate-session;;<br  />
    monster|monsterwm ) exec monsterwm;;<br  />
    notion            ) exec notion;;<br  />
    openbox           ) exec openbox-session;;<br  />
    unity             ) exec unity;;<br  />
    xfce|xfce4        ) exec startxfce4;;<br  />
    xmonad            ) exec xmonad;;<br  />
    *) exec $1;;<br  />
esac<br  />
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-bash">$ xinit
$ xinit gnome
$ xinit kde
$ xinit wmaker

$ startx
$ startx ~/.xinitrc gnome
$ startx ~/.xinitrc kde
$ startx ~/.xinitrc wmaker
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">1.18</span> xinitrc</h3>
<div class="outline-text-3" id="text-1-18">
<blockquote>
<p>
session=${1:-xfce}<br  />
</p>

<p>
case $session in<br  />
    chromium         ) exec chromium;;<br  />
    awesome           ) exec awesome;;<br  />
    bspwm             ) exec bspwm;;<br  />
    catwm             ) exec catwm;;<br  />
    cinnamon          ) exec cinnamon-session;;<br  />
    dwm               ) exec dwm;;<br  />
    enlightenment     ) exec enlightenment<sub>start</sub>;;<br  />
    ede               ) exec startede;;<br  />
    fluxbox           ) exec startfluxbox;;<br  />
    gnome             ) exec gnome-session;;<br  />
    gnome-classic     ) exec gnome-session &#x2013;session=gnome-classic;;<br  />
    i3|i3wm           ) exec i3;;<br  />
    icewm             ) exec icewm-session;;<br  />
    jwm               ) exec jwm;;<br  />
    kde               ) exec startkde;;<br  />
    mate              ) exec mate-session;;<br  />
    monster|monsterwm ) exec monsterwm;;<br  />
    notion            ) exec notion;;<br  />
    openbox           ) exec openbox-session;;<br  />
    unity             ) exec unity;;<br  />
    xfce|xfce4        ) exec startxfce4;;<br  />
    xmonad            ) exec xmonad;;<br  />
    *) exec $1;;<br  />
esac<br  />
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">1.19</span> xrandr</h3>
<div class="outline-text-3" id="text-1-19">
<p>
archlinux 下显示器管理利器 xrandr<br  />
</p>

<p>
xrandr 显示可以识别到的显示器<br  />
</p>

<p>
xrandr &#x2013;output VGA &#x2013;auto 当前桌面会复制到VGA上面，此时执行xrandr会看到有了VGA-0<br  />
</p>

<p>
扩展桌面 xrandr -&#x2014;output VGA-0 &#x2013;auto &#x2013;left-of LVDS<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">1.20</span> 备份和恢复已安装软件包</h3>
<div class="outline-text-3" id="text-1-20">
<blockquote>
<p>
一、备份和恢复已安装软件包<br  />
定期备份软件包是个好习惯。万一系统出了大问题，需要重装，就可以利用备份的软件包恢复到原先的系统。<br  />
</p>

<p>
第一步，生成系统上安装的非本地（即从官方仓库获取的）软件包列表：<br  />
 $ comm -23 &lt;(pacman -Qeq|sort) &lt;(pacman -Qmq|sort) &gt; pkglist<br  />
把生成的pkglist存储在一个安全的地方，比如U盘，或者gist.github.com、evernote、dropbox之类的文本储存网站。<br  />
今后重装系统时，把pkglist复制到新系统。<br  />
使用如下命令安装所有软件包：<br  />
 $ pacman -S $(&lt; pkglist)<br  />
要是备份的软件包列表包含非官方软件包（从AUR或其他什么地方下载的），就得使用下面这个吓人的命令了，不然pacman会出错：<br  />
</p>

<p>
$ pacman -S &#x2013;needed $(diff &lt;(cat badpkglist|sort) &lt;(diff &lt;(cat badpkglist|sort) &lt;(pacman -Slq|sort)|grep \&lt;|cut -f2 -d' ')|grep \&lt;|cut -f2 -d' ')<br  />
解释：<br  />
</p>

<p>
pacman -Slq列出所有可以安装的软件包。由于输出是按照来源仓库排序的，需要再调用sort排序。<br  />
排序是为diff命令比对列表做准备。<br  />
第一个diff返回所有无法安装的软件包；第二个返回所有可以安装的软件包。<br  />
&#x2013;needed表示跳过已安装软件包。<br  />
可以接着用yaourt恢复从AUR获取的软件包（不推荐）：<br  />
</p>

<p>
$ yaourt -S &#x2013;noconfirm $(diff &lt;(cat badpkglist|sort) &lt;(pacman -Slq|sort) |grep \&lt;|cut -f2 -d' ')<br  />
最后，还可以卸载掉新系统上安装的、但之前系统并未安装的软件包。 警告：务必小心使用，仔细查看pacman输出，避免悲剧。<br  />
</p>

<p>
$ pacman -Rsu $(diff &lt;(cat badpkglist|sort) &lt;(pacman -Qq|sort) | grep \&gt;|cut -f2 -d' ')<br  />
</p>

<p>
二、列出所有不属于base或base-devel的已安装软件包<br  />
下列命令输出所有不属于base或base-devel软件包组的已安装软件包。这些软件包一般都是用户自己安装的：<br  />
##############################<br  />
##############################<br  />
##############################<br  />
</p>

<p>
comm -23 &lt;(pacman -Qeq|sort) &lt;(pacman -Qgq base base-devel|sort)  &gt;pkglist<br  />
comm -12 &lt;(comm -23 &lt;(pacman -Qeq|sort) &lt;(pacman -Qmq|sort)) &lt;(sort pkglist) | pacman -S -           # paclist<br  />
comm -13 &lt;(comm -23 &lt;(pacman -Qeq|sort) &lt;(pacman -Qmq|sort)) &lt;(sort pkglist) | yaourt -S -              #aurlist<br  />
comm -12 &lt;(comm -23 &lt;(pacman -Qdq|sort) &lt;(pacman -Qmq|sort)) &lt;(sort pkglist) | pacman -S &#x2013;asdeps -      #asdepslist<br  />
##############################<br  />
##############################<br  />
##############################<br  />
</p>

<p>
三、重新安装所有软件包<br  />
</p>

<p>
这要是你的系统遭到了大规模破坏（比如rm -rf什么的），可以通过pacman重新安装所有软件包来挽救。<br  />
</p>

<p>
如果没有安装外来软件包（比如来自AUR的），使用如下命令即可：<br  />
</p>

<p>
$ pacman -Qeq | pacman -S -<br  />
$ pacman -Qdq | pacman -S &#x2013;asdeps -<br  />
如果安装了外来软件包，使用上面的命令会出错。下面的命令先生成所有软件包列表，再用pacman -Qmq剔除外来软件包，即重新安装所有仓库中可以找到的软件包，同时保留依赖安装、手动安装标志：<br  />
</p>

<p>
$ comm -23 &lt;(pacman -Qeq) &lt;(pacman -Qmq) | pacman -S -<br  />
$ comm -23 &lt;(pacman -Qdq) &lt;(pacman -Qmq) | pacman -S &#x2013;asdeps -<br  />
</p>


<p>
1.Recreate a package from the file system<br  />
Keeping a list of explicitly installed packages can be useful to speed up installation on a new system:<br  />
</p>

<p>
$ pacman -Qqe &gt; pkglist.txt<br  />
</p>

<p>
Note: If you used -Qqet, when reinstalling the list all the non-top-level packages would be set as dependencies.<br  />
To install packages from the list backup, run:<br  />
</p>

<p>
    $ pacman -S - &lt; pkglist.txt<br  />
Tip: Use     comm -13 &lt;(pacman -Qqdt | sort) &lt;(pacman -Qqdtt | sort) &gt; optdeplist.txt     to also create a list of the installed optional dependencies which can be reinstalled with &#x2013;asdeps.<br  />
In case the list includes foreign packages, such as AUR packages, remove them first:<br  />
</p>

<p>
    $ pacman -S $(comm -12 &lt;(pacman -Slq | sort) &lt;(sort pkglist.txt))<br  />
To remove all the packages on your system that are not mentioned in the list:<br  />
</p>

<p>
$ pacman -Rsu $(comm -23 &lt;(pacman -Qq | sort) &lt;(sort pkglist.txt))<br  />
</p>

<p>
2.Reinstalling all packages<br  />
To reinstall all native packages, use:<br  />
</p>

<p>
    $ pacman -Qnq | pacman -S -<br  />
Foreign (AUR) packages must be reinstalled separately; you can list them with     pacman -Qmq.<br  />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">1.21</span> 查看文件夹大小</h3>
<div class="outline-text-3" id="text-1-21">
<div class="org-src-container">

<pre class="src src-bash">df -h   <span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">&#26597;&#30475;&#25346;&#36733;&#20449;&#24687;</span>
du -sh  <span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">&#24403;&#21069;&#30446;&#24405;</span>
du -sh *    sort -n &#32479;&#35745;&#24403;&#21069;&#25991;&#20214;&#22841;(&#30446;&#24405;)&#22823;&#23567;&#65292;&#24182;&#25353;&#25991;&#20214;&#22823;&#23567;&#25490;&#24207;
du -skh /video
sudo du -skh /var
</pre>
</div>
</div>
</div>
