linux_FAQ/archlinux_FAQ.html

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">1.22</span> 常用正则表达式</h3>
<div class="outline-text-3" id="text-1-22">
<div class="org-src-container">

<pre class="src src-bash"><span class="linenr"> 1: </span>&#24120;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;
<span class="linenr"> 2: </span>&#19968;&#12289;&#26657;&#39564;&#25968;&#23383;&#30340;&#34920;&#36798;&#24335;
<span class="linenr"> 3: </span>&#25968;&#23383;&#65306;^[0-9]*$
<span class="linenr"> 4: </span>n&#20301;&#30340;&#25968;&#23383;&#65306;^\d{n}$
<span class="linenr"> 5: </span>&#33267;&#23569;n&#20301;&#30340;&#25968;&#23383;&#65306;^\d{n,}$
<span class="linenr"> 6: </span>m-n&#20301;&#30340;&#25968;&#23383;&#65306;^\d{m,n}$
<span class="linenr"> 7: </span>&#38646;&#21644;&#38750;&#38646;&#24320;&#22836;&#30340;&#25968;&#23383;&#65306;^(0|[1-9][0-9]*)$
<span class="linenr"> 8: </span>&#38750;&#38646;&#24320;&#22836;&#30340;&#26368;&#22810;&#24102;&#20004;&#20301;&#23567;&#25968;&#30340;&#25968;&#23383;&#65306;^([1-9][0-9]*)+(.[0-9]{1,2})?$
<span class="linenr"> 9: </span>&#24102;1-2&#20301;&#23567;&#25968;&#30340;&#27491;&#25968;&#25110;&#36127;&#25968;&#65306;^(<span style="color: #E6DB74;">\-</span>)?\d+(<span style="color: #E6DB74;">\.</span>\d{1,2})?$
<span class="linenr">10: </span>&#27491;&#25968;&#12289;&#36127;&#25968;&#12289;&#21644;&#23567;&#25968;&#65306;^(<span style="color: #E6DB74;">\-</span>|<span style="color: #E6DB74;">\+</span>)?\d+(<span style="color: #E6DB74;">\.</span>\d+)?$
<span class="linenr">11: </span>&#26377;&#20004;&#20301;&#23567;&#25968;&#30340;&#27491;&#23454;&#25968;&#65306;^[0-9]+(<span style="color: #E6DB74;">\.</span>[0-9]{2})?$
<span class="linenr">12: </span>&#26377;1~3&#20301;&#23567;&#25968;&#30340;&#27491;&#23454;&#25968;&#65306;^[0-9]+(<span style="color: #E6DB74;">\.</span>[0-9]{1,3})?$
<span class="linenr">13: </span>&#38750;&#38646;&#30340;&#27491;&#25972;&#25968;&#65306;^[1-9]\d*$ &#25110; ^([1-9][0-9]*){1,3}$ &#25110; ^<span style="color: #E6DB74;">\+</span>?[1-9][0-9]*$
<span class="linenr">14: </span>&#38750;&#38646;&#30340;&#36127;&#25972;&#25968;&#65306;^<span style="color: #E6DB74;">\-</span>[1-9][]0-9<span style="color: #E6DB74;">"*$ &#25110; ^-[1-9]\d*$</span>
<span class="linenr">15: </span><span style="color: #E6DB74;">&#38750;&#36127;&#25972;&#25968;&#65306;^\d+$ &#25110; ^[1-9]\d*|0$</span>
<span class="linenr">16: </span><span style="color: #E6DB74;">&#38750;&#27491;&#25972;&#25968;&#65306;^-[1-9]\d*|0$ &#25110; ^((-\d+)|(0+))$</span>
<span class="linenr">17: </span><span style="color: #E6DB74;">&#38750;&#36127;&#28014;&#28857;&#25968;&#65306;^\d+(\.\d+)?$ &#25110; ^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$</span>
<span class="linenr">18: </span><span style="color: #E6DB74;">&#38750;&#27491;&#28014;&#28857;&#25968;&#65306;^((-\d+(\.\d+)?)|(0+(\.0+)?))$ &#25110; ^(-([1-9]\d*\.\d*|0\.\d*[1-9]\d*))|0?\.0+|0$</span>
<span class="linenr">19: </span><span style="color: #E6DB74;">&#27491;&#28014;&#28857;&#25968;&#65306;^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$ &#25110; ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$</span>
<span class="linenr">20: </span><span style="color: #E6DB74;">&#36127;&#28014;&#28857;&#25968;&#65306;^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$ &#25110; ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$</span>
<span class="linenr">21: </span><span style="color: #E6DB74;">&#28014;&#28857;&#25968;&#65306;^(-?\d+)(\.\d+)?$ &#25110; ^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$</span>
<span class="linenr">22: </span><span style="color: #E6DB74;">&#26657;&#39564;&#23383;&#31526;&#30340;&#34920;&#36798;&#24335;</span>
<span class="linenr">23: </span><span style="color: #E6DB74;">&#27721;&#23383;&#65306;^[\u4e00-\u9fa5]{0,}$</span>
<span class="linenr">24: </span><span style="color: #E6DB74;">&#33521;&#25991;&#21644;&#25968;&#23383;&#65306;^[A-Za-z0-9]+$ &#25110; ^[A-Za-z0-9]{4,40}$</span>
<span class="linenr">25: </span><span style="color: #E6DB74;">&#38271;&#24230;&#20026;3-20&#30340;&#25152;&#26377;&#23383;&#31526;&#65306;^.{3,20}$</span>
<span class="linenr">26: </span><span style="color: #E6DB74;">&#30001;26&#20010;&#33521;&#25991;&#23383;&#27597;&#32452;&#25104;&#30340;&#23383;&#31526;&#20018;&#65306;^[A-Za-z]+$</span>
<span class="linenr">27: </span><span style="color: #E6DB74;">&#30001;26&#20010;&#22823;&#20889;&#33521;&#25991;&#23383;&#27597;&#32452;&#25104;&#30340;&#23383;&#31526;&#20018;&#65306;^[A-Z]+$</span>
<span class="linenr">28: </span><span style="color: #E6DB74;">&#30001;26&#20010;&#23567;&#20889;&#33521;&#25991;&#23383;&#27597;&#32452;&#25104;&#30340;&#23383;&#31526;&#20018;&#65306;^[a-z]+$</span>
<span class="linenr">29: </span><span style="color: #E6DB74;">&#30001;&#25968;&#23383;&#21644;26&#20010;&#33521;&#25991;&#23383;&#27597;&#32452;&#25104;&#30340;&#23383;&#31526;&#20018;&#65306;^[A-Za-z0-9]+$</span>
<span class="linenr">30: </span><span style="color: #E6DB74;">&#30001;&#25968;&#23383;&#12289;26&#20010;&#33521;&#25991;&#23383;&#27597;&#25110;&#32773;&#19979;&#21010;&#32447;&#32452;&#25104;&#30340;&#23383;&#31526;&#20018;&#65306;^\w+$ &#25110; ^\w{3,20}$</span>
<span class="linenr">31: </span><span style="color: #E6DB74;">&#20013;&#25991;&#12289;&#33521;&#25991;&#12289;&#25968;&#23383;&#21253;&#25324;&#19979;&#21010;&#32447;&#65306;^[\u4E00-\u9FA5A-Za-z0-9_]+$</span>
<span class="linenr">32: </span><span style="color: #E6DB74;">&#20013;&#25991;&#12289;&#33521;&#25991;&#12289;&#25968;&#23383;&#20294;&#19981;&#21253;&#25324;&#19979;&#21010;&#32447;&#31561;&#31526;&#21495;&#65306;^[\u4E00-\u9FA5A-Za-z0-9]+$ &#25110; ^[\u4E00-\u9FA5A-Za-z0-9]{2,20}$</span>
<span class="linenr">33: </span><span style="color: #E6DB74;">&#21487;&#20197;&#36755;&#20837;&#21547;&#26377;^%&amp;',;=?$\"&#31561;&#23383;&#31526;&#65306;[^%&amp;',;=?$\x22]+</span>
<span class="linenr">34: </span><span style="color: #E6DB74;">&#31105;&#27490;&#36755;&#20837;&#21547;&#26377;~&#30340;&#23383;&#31526;&#65306;[^~\x22]+</span>
<span class="linenr">35: </span><span style="color: #E6DB74;">&#19977;&#12289;&#29305;&#27530;&#38656;&#27714;&#34920;&#36798;&#24335;</span>
<span class="linenr">36: </span><span style="color: #E6DB74;">Email&#22320;&#22336;&#65306;^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$</span>
<span class="linenr">37: </span><span style="color: #E6DB74;">&#22495;&#21517;&#65306;[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+/.?</span>
<span class="linenr">38: </span><span style="color: #E6DB74;">InternetURL&#65306;[a-zA-z]+://[^\s]* &#25110; ^http://([\w-]+\.)+[\w-]+(/[\w-./?%&amp;=]*)?$</span>
<span class="linenr">39: </span><span style="color: #E6DB74;">&#25163;&#26426;&#21495;&#30721;&#65306;^(13[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$</span>
<span class="linenr">40: </span><span style="color: #E6DB74;">&#30005;&#35805;&#21495;&#30721;("</span>XXX-XXXXXXX<span style="color: #E6DB74;">"&#12289;"</span>XXXX-XXXXXXXX<span style="color: #E6DB74;">"&#12289;"</span>XXX-XXXXXXX<span style="color: #E6DB74;">"&#12289;"</span>XXX-XXXXXXXX<span style="color: #E6DB74;">"&#12289;"</span>XXXXXXX<span style="color: #E6DB74;">"&#21644;"</span>XXXXXXXX)&#65306;^(<span style="color: #E6DB74;">\(</span>\d{3,4}-)|\d{3.4}-)?\d{7,8}$
<span class="linenr">41: </span><span style="color: #F92672; font-style: italic;">&#22269;&#20869;&#30005;&#35805;&#21495;&#30721;</span>(0511-4405222&#12289;021-87888822)&#65306;\d{3}-\d{8}|\d{4}-\d{7}
<span class="linenr">42: </span>&#30005;&#35805;&#21495;&#30721;&#27491;&#21017;&#34920;&#36798;&#24335;&#65288;&#25903;&#25345;&#25163;&#26426;&#21495;&#30721;&#65292;3-4&#20301;&#21306;&#21495;&#65292;7-8&#20301;&#30452;&#25773;&#21495;&#30721;&#65292;1&#65293;4&#20301;&#20998;&#26426;&#21495;&#65289;: ((\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)
<span class="linenr">43: </span><span style="color: #F92672; font-style: italic;">&#36523;&#20221;&#35777;&#21495;</span>(15&#20301;&#12289;18&#20301;&#25968;&#23383;)&#65292;&#26368;&#21518;&#19968;&#20301;&#26159;&#26657;&#39564;&#20301;&#65292;&#21487;&#33021;&#20026;&#25968;&#23383;&#25110;&#23383;&#31526;X&#65306;(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)
<span class="linenr">44: </span><span style="color: #F92672; font-style: italic;">&#24080;&#21495;&#26159;&#21542;&#21512;&#27861;</span>(&#23383;&#27597;&#24320;&#22836;&#65292;&#20801;&#35768;5-16&#23383;&#33410;&#65292;&#20801;&#35768;&#23383;&#27597;&#25968;&#23383;&#19979;&#21010;&#32447;)&#65306;^[a-zA-Z][a-zA-Z0-9_]{4,15}$
<span class="linenr">45: </span><span style="color: #F92672; font-style: italic;">&#23494;&#30721;</span>(&#20197;&#23383;&#27597;&#24320;&#22836;&#65292;&#38271;&#24230;&#22312;6~18&#20043;&#38388;&#65292;&#21482;&#33021;&#21253;&#21547;&#23383;&#27597;&#12289;&#25968;&#23383;&#21644;&#19979;&#21010;&#32447;)&#65306;^[a-zA-Z]\w{5,17}$
<span class="linenr">46: </span><span style="color: #F92672; font-style: italic;">&#24378;&#23494;&#30721;</span>(&#24517;&#39035;&#21253;&#21547;&#22823;&#23567;&#20889;&#23383;&#27597;&#21644;&#25968;&#23383;&#30340;&#32452;&#21512;&#65292;&#19981;&#33021;&#20351;&#29992;&#29305;&#27530;&#23383;&#31526;&#65292;&#38271;&#24230;&#22312;8-10&#20043;&#38388;)&#65306;^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$
<span class="linenr">47: </span>&#26085;&#26399;&#26684;&#24335;&#65306;^\d{4}-\d{1,2}-\d{1,2}
<span class="linenr">48: </span><span style="color: #F92672; font-style: italic;">&#19968;&#24180;&#30340;12&#20010;&#26376;</span>(01&#65374;09&#21644;1&#65374;12)&#65306;^(0?[1-9]|1[0-2])$
<span class="linenr">49: </span><span style="color: #F92672; font-style: italic;">&#19968;&#20010;&#26376;&#30340;31&#22825;</span>(01&#65374;09&#21644;1&#65374;31)&#65306;^((0?[1-9])|((1|2)[0-9])|30|31)$
<span class="linenr">50: </span>&#38065;&#30340;&#36755;&#20837;&#26684;&#24335;&#65306;
<span class="linenr">51: </span>&#26377;&#22235;&#31181;&#38065;&#30340;&#34920;&#31034;&#24418;&#24335;&#25105;&#20204;&#21487;&#20197;&#25509;&#21463;:<span style="color: #E6DB74;">"10000.00"</span> &#21644; <span style="color: #E6DB74;">"10,000.00"</span>, &#21644;&#27809;&#26377; <span style="color: #E6DB74;">"&#20998;"</span> &#30340; <span style="color: #E6DB74;">"10000"</span> &#21644; <span style="color: #E6DB74;">"10,000"</span>&#65306;^[1-9][0-9]*$
<span class="linenr">52: </span>&#36825;&#34920;&#31034;&#20219;&#24847;&#19968;&#20010;&#19981;&#20197;0&#24320;&#22836;&#30340;&#25968;&#23383;,&#20294;&#26159;,&#36825;&#20063;&#24847;&#21619;&#30528;&#19968;&#20010;&#23383;&#31526;<span style="color: #E6DB74;">"0"</span>&#19981;&#36890;&#36807;,&#25152;&#20197;&#25105;&#20204;&#37319;&#29992;&#19979;&#38754;&#30340;&#24418;&#24335;&#65306;^(0|[1-9][0-9]*)$
<span class="linenr">53: </span>&#19968;&#20010;0&#25110;&#32773;&#19968;&#20010;&#19981;&#20197;0&#24320;&#22836;&#30340;&#25968;&#23383;.&#25105;&#20204;&#36824;&#21487;&#20197;&#20801;&#35768;&#24320;&#22836;&#26377;&#19968;&#20010;&#36127;&#21495;&#65306;^(0|-?[1-9][0-9]*)$
<span class="linenr">54: </span>&#36825;&#34920;&#31034;&#19968;&#20010;0&#25110;&#32773;&#19968;&#20010;&#21487;&#33021;&#20026;&#36127;&#30340;&#24320;&#22836;&#19981;&#20026;0&#30340;&#25968;&#23383;.&#35753;&#29992;&#25143;&#20197;0&#24320;&#22836;&#22909;&#20102;.&#25226;&#36127;&#21495;&#30340;&#20063;&#21435;&#25481;,&#22240;&#20026;&#38065;&#24635;&#19981;&#33021;&#26159;&#36127;&#30340;&#21543;&#12290;&#19979;&#38754;&#25105;&#20204;&#35201;&#21152;&#30340;&#26159;&#35828;&#26126;&#21487;&#33021;&#30340;&#23567;&#25968;&#37096;&#20998;&#65306;^[0-9]+(.[0-9]+)?$
<span class="linenr">55: </span>&#24517;&#39035;&#35828;&#26126;&#30340;&#26159;,&#23567;&#25968;&#28857;&#21518;&#38754;&#33267;&#23569;&#24212;&#35813;&#26377;1&#20301;&#25968;,&#25152;&#20197;<span style="color: #E6DB74;">"10."</span>&#26159;&#19981;&#36890;&#36807;&#30340;,&#20294;&#26159; <span style="color: #E6DB74;">"10"</span> &#21644; <span style="color: #E6DB74;">"10.2"</span> &#26159;&#36890;&#36807;&#30340;&#65306;^[0-9]+(.[0-9]{2})?$
<span class="linenr">56: </span>&#36825;&#26679;&#25105;&#20204;&#35268;&#23450;&#23567;&#25968;&#28857;&#21518;&#38754;&#24517;&#39035;&#26377;&#20004;&#20301;,&#22914;&#26524;&#20320;&#35748;&#20026;&#22826;&#33499;&#21051;&#20102;,&#21487;&#20197;&#36825;&#26679;&#65306;^[0-9]+(.[0-9]{1,2})?$
<span class="linenr">57: </span>&#36825;&#26679;&#23601;&#20801;&#35768;&#29992;&#25143;&#21482;&#20889;&#19968;&#20301;&#23567;&#25968;.&#19979;&#38754;&#25105;&#20204;&#35813;&#32771;&#34385;&#25968;&#23383;&#20013;&#30340;&#36887;&#21495;&#20102;,&#25105;&#20204;&#21487;&#20197;&#36825;&#26679;&#65306;^[0-9]{1,3}(,[0-9]{3})*(.[0-9]{1,2})?$
<span class="linenr">58: </span>1&#21040;3&#20010;&#25968;&#23383;,&#21518;&#38754;&#36319;&#30528;&#20219;&#24847;&#20010; &#36887;&#21495;+3&#20010;&#25968;&#23383;,&#36887;&#21495;&#25104;&#20026;&#21487;&#36873;,&#32780;&#19981;&#26159;&#24517;&#39035;&#65306;^([0-9]+|[0-9]{1,3}(,[0-9]{3})*)(.[0-9]{1,2})?$
<span class="linenr">59: </span>&#22791;&#27880;&#65306;&#36825;&#23601;&#26159;&#26368;&#32456;&#32467;&#26524;&#20102;,&#21035;&#24536;&#20102;<span style="color: #E6DB74;">"+"</span>&#21487;&#20197;&#29992;<span style="color: #E6DB74;">"*"</span>&#26367;&#20195;&#22914;&#26524;&#20320;&#35273;&#24471;&#31354;&#23383;&#31526;&#20018;&#20063;&#21487;&#20197;&#25509;&#21463;&#30340;&#35805;(&#22855;&#24618;,&#20026;&#20160;&#20040;?)&#26368;&#21518;,&#21035;&#24536;&#20102;&#22312;&#29992;&#20989;&#25968;&#26102;&#21435;&#25481;&#21435;&#25481;&#37027;&#20010;&#21453;&#26012;&#26464;,&#19968;&#33324;&#30340;&#38169;&#35823;&#37117;&#22312;&#36825;&#37324;
<span class="linenr">60: </span>xml&#25991;&#20214;&#65306;^([a-zA-Z]+-?)+[a-zA-Z0-9]+<span style="color: #E6DB74;">\\</span>.[x|X][m|M][l|L]$
<span class="linenr">61: </span>&#20013;&#25991;&#23383;&#31526;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#65306;[\u4e00-\u9fa5]
<span class="linenr">62: </span>&#21452;&#23383;&#33410;&#23383;&#31526;&#65306;[^\x00-\xff] (&#21253;&#25324;&#27721;&#23383;&#22312;&#20869;&#65292;&#21487;&#20197;&#29992;&#26469;&#35745;&#31639;&#23383;&#31526;&#20018;&#30340;&#38271;&#24230;(&#19968;&#20010;&#21452;&#23383;&#33410;&#23383;&#31526;&#38271;&#24230;&#35745;2&#65292;ASCII&#23383;&#31526;&#35745;1))
<span class="linenr">63: </span>&#31354;&#30333;&#34892;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#65306;\n\s*\r (&#21487;&#20197;&#29992;&#26469;&#21024;&#38500;&#31354;&#30333;&#34892;)
<span class="linenr">64: </span>HTML&#26631;&#35760;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#65306;&lt;(\S*?)[^&gt;]*&gt;.*?|&lt;.*? /&gt; ( &#39318;&#23614;&#31354;&#30333;&#23383;&#31526;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#65306;^\s*|\s*$<span style="color: #F92672;">&#25110;</span>(^\s*)|(\s*$) (&#21487;&#20197;&#29992;&#26469;&#21024;&#38500;&#34892;&#39318;&#34892;&#23614;&#30340;&#31354;&#30333;&#23383;&#31526;(&#21253;&#25324;&#31354;&#26684;&#12289;&#21046;&#34920;&#31526;&#12289;&#25442;&#39029;&#31526;&#31561;&#31561;)&#65292;&#38750;&#24120;&#26377;&#29992;&#30340;&#34920;&#36798;&#24335;)
<span class="linenr">65: </span>&#33150;&#35759;QQ&#21495;&#65306;[1-9][0-9]{4,} (&#33150;&#35759;QQ&#21495;&#20174;10000&#24320;&#22987;)
<span class="linenr">66: </span>&#20013;&#22269;&#37038;&#25919;&#32534;&#30721;&#65306;[1-9]\d{5}(?!\d) (&#20013;&#22269;&#37038;&#25919;&#32534;&#30721;&#20026;6&#20301;&#25968;&#23383;)
<span class="linenr">67: </span><span style="color: #F92672; font-style: italic;">IP&#22320;&#22336;&#65306;</span>((?:(?:25[0-5]|2[0-4]<span style="color: #E6DB74;">\\</span>d|[01]?<span style="color: #E6DB74;">\\</span>d?<span style="color: #E6DB74;">\\</span>d)<span style="color: #E6DB74;">\\</span>.){3}(?:25[0-5]|2[0-4]<span style="color: #E6DB74;">\\</span>d|[01]?<span style="color: #E6DB74;">\\</span>d?<span style="color: #E6DB74;">\\</span>d))
</pre>
</div>
</div>
</div>
