linux_FAQ/archlinux_FAQ.org
** 挂载非系统分区

默认情况下，在ArchLinux中挂载非系统分区需要密码验证，非常麻烦，可以修改配置文件：

/usr/share/polkit-1/actions/org.freedesktop.udisks2.policy

将此配置文件中的

<action id="org.freedesktop.udisks2.filesystem-mount-system">

标签中的子标签

<allow_active></allow_active>

的值改为yes即可无需通过密码验证直接挂载分区。

** 镜像排速

reflector --verbose -l 5 --sort rate --save /etc/pacman.d/mirrorlist

** 清理日志

- 手动清理日志
  
  /var/log/journal 存放着日志, rm 应该能工作. 或者使用journalctl,

- 清理日志使总大小小于 100M:

  $ journalctl --vacuum-size=100M

- 清理最早两周前的日志.

  $ journalctl --vacuum-time=2weeks

** 清理无用包

sudo pacman -Rs $(pacman -Qtdq)

sudo paccache -r

paccache -rk 1

** 删除文本的行

sed -i '1d' a.txt删首行

sed -i '$d' b.txt删尾行

sed -i 's/[ ]*//g' c.txt删空格

sed -i '/^$/d' d.txt删空行

sed -i ‘/^[0-9]*$/d' a.txt删包含数字的行

sed -i ‘1,2d’a.txt删2行

sed -i ‘/love/d’ a.txt删包含string的行

** 修复引导.txt

chroot 

安装&更新 Grub,代码如下：

#+BEGIN_SRC bash
　　grub2-install /dev/sda
　　grub2-mkconfig -o /boot/grub2/grub.cfg
#+END_SRC

[[http://blog.csdn.net/u011152627/article/details/18925121][寒假折腾Archlinux的一些经验（新手向）--桌面配置篇]]

** 修改屏幕亮度


 /sys/class/backlight/acpi_video0/brightness 设置为12

** 用户

- 修改用户名
  usermod -l newuser -d /home/newuser -m olduser

- 添加新用户
  useradd –d /home/myname -m myame
  useradd -m -g 初始组 -G 附加组 -s 登陆shell 用户

** 重装所有软件

如何重装所有包并保留安装和依赖信息？

重装所有软件包：pacman -S $(pacman -Qnq)（-S 选项会保留安装缘由）。

接着需要重装外来包（不在官方仓库里的软件包）。外来包可通过pacman -Qmq查看。

---------

