linux_FAQ/archlinux_FAQ.html
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">1.23</span> 挂载非系统分区</h3>
<div class="outline-text-3" id="text-1-23">
<p>
默认情况下，在ArchLinux中挂载非系统分区需要密码验证，非常麻烦，可以修改配置文件：<br  />
</p>

<p>
/usr/share/polkit-1/actions/org.freedesktop.udisks2.policy<br  />
</p>

<p>
将此配置文件中的<br  />
</p>

<p>
&lt;action id="org.freedesktop.udisks2.filesystem-mount-system"&gt;<br  />
</p>

<p>
标签中的子标签<br  />
</p>

<p>
&lt;allow<sub>active</sub>&gt;&lt;/allow<sub>active</sub>&gt;<br  />
</p>

<p>
的值改为yes即可无需通过密码验证直接挂载分区。<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">1.24</span> 镜像排速</h3>
<div class="outline-text-3" id="text-1-24">
<p>
reflector &#x2013;verbose -l 5 &#x2013;sort rate &#x2013;save /etc/pacman.d/mirrorlist<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">1.25</span> 清理日志</h3>
<div class="outline-text-3" id="text-1-25">
<ul class="org-ul">
<li><p>
手动清理日志<br  />
</p>

<p>
/var/log/journal 存放着日志, rm 应该能工作. 或者使用journalctl,<br  />
</p></li>

<li><p>
清理日志使总大小小于 100M:<br  />
</p>

<p>
$ journalctl &#x2013;vacuum-size=100M<br  />
</p></li>

<li><p>
清理最早两周前的日志.<br  />
</p>

<p>
$ journalctl &#x2013;vacuum-time=2weeks<br  />
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">1.26</span> 清理无用包</h3>
<div class="outline-text-3" id="text-1-26">
<p>
sudo pacman -Rs $(pacman -Qtdq)<br  />
</p>

<p>
sudo paccache -r<br  />
</p>

<p>
paccache -rk 1<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">1.27</span> 删除文本的行</h3>
<div class="outline-text-3" id="text-1-27">
<p>
sed -i '1d' a.txt删首行<br  />
</p>

<p>
sed -i '$d' b.txt删尾行<br  />
</p>

<p>
sed -i 's/[ ]*//g' c.txt删空格<br  />
</p>

<p>
sed -i '/^$/d' d.txt删空行<br  />
</p>

<p>
sed -i ‘/^[0-9]*$/d' a.txt删包含数字的行<br  />
</p>

<p>
sed -i ‘1,2d’a.txt删2行<br  />
</p>

<p>
sed -i ‘/love/d’ a.txt删包含string的行<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">1.28</span> 修复引导.txt</h3>
<div class="outline-text-3" id="text-1-28">
<p>
chroot<br  />
</p>

<p>
安装&amp;更新 Grub,代码如下：<br  />
</p>

<div class="org-src-container">

<pre class="src src-bash">&#12288;&#12288;grub2-install /dev/sda
&#12288;&#12288;grub2-mkconfig -o /boot/grub2/grub.cfg
</pre>
</div>

<p>
<a href="http://blog.csdn.net/u011152627/article/details/18925121">寒假折腾Archlinux的一些经验（新手向）&#x2013;桌面配置篇</a><br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">1.29</span> 修改屏幕亮度</h3>
<div class="outline-text-3" id="text-1-29">
<p>
/sys/class/backlight/acpi<sub>video0</sub>/brightness 设置为12<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">1.30</span> 用户</h3>
<div class="outline-text-3" id="text-1-30">
<ul class="org-ul">
<li>修改用户名<br  />
usermod -l newuser -d /home/newuser -m olduser<br  /></li>

<li>添加新用户<br  />
useradd –d /home/myname -m myame<br  />
useradd -m -g 初始组 -G 附加组 -s 登陆shell 用户<br  /></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">1.31</span> 重装所有软件</h3>
<div class="outline-text-3" id="text-1-31">
<p>
如何重装所有包并保留安装和依赖信息？<br  />
</p>

<p>
重装所有软件包：pacman -S $(pacman -Qnq)（-S 选项会保留安装缘由）。<br  />
</p>

<p>
接着需要重装外来包（不在官方仓库里的软件包）。外来包可通过pacman -Qmq查看。<br  />
</p>

<hr  />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-18 Sun 17:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>